Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8520.PIC
      <edc:DCRDef edc:access="nn------" edc:cname="CONFIG5H" edc:desc="" edc:factorydefault="0xc0" edc:impl="0xc0" edc:name="CONFIG5H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc0" edc:default="0xc0" edc:_addr="0x300009">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="CPB" edc:desc="Boot Block Code Protection bit" edc:mask="0x1" edc:name="CPB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0007FFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0007FFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data EEPROM Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not code-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG6L" edc:desc="" edc:factorydefault="0xff" edc:impl="0xff" edc:name="CONFIG6L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf" edc:default="0xff" edc:_addr="0x30000A">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRT0" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000800-001FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000800-001FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT1" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (002000-003FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (002000-003FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT2" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (004000-005FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (004000-005FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT3" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 3 (006000-007FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 3 (006000-007FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:desc="Maintain bits as 1s" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn-----" edc:cname="CONFIG6H" edc:desc="" edc:factorydefault="0xe0" edc:impl="0xe0" edc:name="CONFIG6H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe0" edc:default="0xe0" edc:_addr="0x30000B">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers (300000-3000FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers (300000-3000FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0007FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0007FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG7L" edc:desc="" edc:factorydefault="0xff" edc:impl="0xff" edc:name="CONFIG7L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf" edc:default="0xff" edc:_addr="0x30000C">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EBTR0" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000800-001FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000800-001FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR1" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (002000-003FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (002000-003FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR2" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (004000-005FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (004000-005FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR3" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 3 (006000-007FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 3 (006000-007FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:desc="Maintain bits as 1s" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-n------" edc:cname="CONFIG7H" edc:desc="" edc:factorydefault="0x40" edc:impl="0x40" edc:name="CONFIG7H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x40" edc:default="0x40" edc:_addr="0x30000D">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="EBTRB" edc:desc="Boot Block Table Read Protection bit" edc:mask="0x1" edc:name="EBTRB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0007FFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0007FFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0xb00">
      <edc:DEVIDToRev edc:revlist="a0" edc:value="0xb00"/>
      <edc:DEVIDToRev edc:revlist="a1" edc:value="0xb01"/>
      <edc:DEVIDToRev edc:revlist="a1, low power" edc:value="0xb11"/>
    </edc:DeviceIDSector>
    <edc:EEDataSector edc:beginaddr="0xf00000" edc:endaddr="0xf00400" edc:regionid="eedata"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x60" edc:endaddr="0x100" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0x1" edc:beginaddr="0x100" edc:endaddr="0x200" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="0x2" edc:beginaddr="0x200" edc:endaddr="0x300" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="0x3" edc:beginaddr="0x300" edc:endaddr="0x400" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="0x4" edc:beginaddr="0x400" edc:endaddr="0x500" edc:regionid="gpr4"/>
      <edc:GPRDataSector edc:bank="0x5" edc:beginaddr="0x500" edc:endaddr="0x600" edc:regionid="gpr5"/>
      <edc:GPRDataSector edc:bank="0x6" edc:beginaddr="0x600" edc:endaddr="0x700" edc:regionid="gpr6"/>
      <edc:GPRDataSector edc:bank="0x7" edc:beginaddr="0x700" edc:endaddr="0x800" edc:regionid="gpr7"/>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:AdjustPoint edc:offset="11" edc:_addr="0xF60"/>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA2" edc:nzwidth="0x8" edc:por="0000000x" edc:_addr="0xF6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCD8" edc:desc="" edc:mask="0x1" edc:name="RCD8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nRC8" edc:desc="" edc:mask="0x1" edc:name="nRC8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RC8_9" edc:desc="" edc:mask="0x1" edc:name="RC8_9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RCD82" edc:desc="" edc:mask="0x1" edc:name="RCD82" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="RC8_92" edc:desc="" edc:mask="0x1" edc:name="RC8_92" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="RC92" edc:desc="" edc:mask="0x1" edc:name="RC92" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nrn" edc:cname="TXSTA2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-010" edc:name="TXSTA2" edc:nzwidth="0x8" edc:por="0000-010" edc:_addr="0xF6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXD8" edc:desc="" edc:mask="0x1" edc:name="TXD8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="TX8_9" edc:desc="" edc:mask="0x1" edc:name="TX8_9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nTX8" edc:desc="" edc:mask="0x1" edc:name="nTX8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TX9D2" edc:desc="" edc:mask="0x1" edc:name="TX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT2" edc:desc="" edc:mask="0x1" edc:name="TRMT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH2" edc:desc="" edc:mask="0x1" edc:name="BRGH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB2" edc:desc="" edc:mask="0x1" edc:name="SENDB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="" edc:mask="0x1" edc:name="SYNC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX92" edc:desc="" edc:mask="0x1" edc:name="TX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC2" edc:desc="" edc:mask="0x1" edc:name="CSRC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXD82" edc:desc="" edc:mask="0x1" edc:name="TXD82" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="TX8_92" edc:desc="" edc:mask="0x1" edc:name="TX8_92" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="TXREG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXREG2" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF6D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXREG2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXREG2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
